## Plan Result (shares-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/140720)



<pre><code>Plan: 60 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_acm_certificate.application_alb_certificate_93966247
  * aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195
  * aws_alb.application_application_load_balancer_alb_05EA9801
  * aws_alb_listener.application_listener_http_D74EC0ED
  * aws_alb_listener.application_listener_https_D31CB055
  * aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F
  * aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B
  * aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6
  * aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511
  * aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2
  * aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99
  * aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED
  * aws_cloudwatch_log_group.app-log-group
  * aws_cloudwatch_log_group.aws-otel-collector-log-group
  * aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0
  * aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1
  * aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0
  * aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_query_0_52F9FF21
  * aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_uptime_0_3A56DFC7
  * aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF
  * aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247
  * aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE
  * aws_dynamodb_table.dynamodb_shares_dynamodb_table_3BFFCB87
  * aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7
  * aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0
  * aws_ecs_cluster.application_ecs_cluster_4DC6EFB3
  * aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6
  * aws_iam_policy.synthetics_synthetics_synthetic_check_access_policy_9A7D8849
  * aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA
  * aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED
  * aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3
  * aws_iam_role.synthetics_synthetic_check_role_A3A5C38B
  * aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355
  * aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E
  * aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF
  * aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725
  * aws_iam_role_policy_attachment.synthetics_synthetics_synthetic_check_access_attach_BC7F9559
  * aws_route53_record.application_alb_certificate_certificate_record_51B45CF2
  * aws_route53_record.application_alb_record_8EA9D3F9
  * aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22
  * aws_route53_zone.application_base_dns_subhosted_zone_77521D1C
  * aws_s3_bucket.synthetics_synthetics_synthetic_check_artifacts_53DD59E6
  * aws_s3_bucket_lifecycle_configuration.synthetics_synthetics_synthetic_check_artifacts_lifecycle_5A7B9150
  * aws_security_group.application_application_load_balancer_alb_security_group_7B45D070
  * aws_security_group.application_ecs_service_ecs_security_group_231C6B1E
  * aws_sns_topic.pagerduty_alarm-critical-topic_F1534579
  * aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3
  * aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84
  * aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B
  * aws_synthetics_canary.synthetics_synthetics_synthetic_check_query_0_99E4AE1B
  * aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB
  * pagerduty_service.pagerduty_pagerduty-critical_464EE7CD
  * pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938
  * pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5
  * pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C
  * pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23
  * pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197



<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD" {
      + id      = (known after apply)
      + json    = (known after apply)
      + version = "2012-10-17"

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogGroups",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
              + "xray:GetSamplingRules",
              + "xray:GetSamplingStatisticSummaries",
              + "xray:GetSamplingTargets",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGet*",
              + "dynamodb:BatchWrite*",
              + "dynamodb:Delete*",
              + "dynamodb:DescribeTable",
              + "dynamodb:Get*",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
              + "sqs:SendMessageBatch",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:996905175585:SharesAPI-Prod-Batch-Delete-Consumer-Queue",
            ]
        }
    }

  # data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_access_4C83FECF will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "synthetics_synthetics_synthetic_check_access_4C83FECF" {
      + id      = (known after apply)
      + json    = (known after apply)
      + version = "2012-10-17"

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::pocket-syntheticchecks-prod/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetBucketLocation",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListAllMyBuckets",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
            ]
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "CloudWatchSynthetics",
                ]
              + variable = "cloudwatch:namespace"
            }
        }
      + statement {
          + actions   = [
              + "ec2:AttachNetworkInterface",
              + "ec2:CreateNetworkInterface",
              + "ec2:DeleteNetworkInterface",
              + "ec2:DescribeNetworkInterfaces",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # aws_acm_certificate.application_alb_certificate_93966247 will be created
  + resource "aws_acm_certificate" "application_alb_certificate_93966247" {
      + arn                       = (known after apply)
      + domain_name               = "shares-api.readitlater.com"
      + domain_validation_options = [
          + {
              + domain_name           = "shares-api.readitlater.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "shares-api.readitlater.com",
        ]
      + tags                      = {
          + "costCenter"  = "Pocket"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "SharesAPI"
        }
      + tags_all                  = {
          + "costCenter"  = "Pocket"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "SharesAPI"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195 will be created
  + resource "aws_acm_certificate_validation" "application_alb_certificate_certificate_validation_25DAB195" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_alb.application_application_load_balancer_alb_05EA9801 will be created
  + resource "aws_alb" "application_application_load_balancer_alb_05EA9801" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = true
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = (known after apply)
      + name_prefix                                                  = "SHARES"
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-610bdb3b",
          + "subnet-b2a036fa",
          + "subnet-cc66bde0",
          + "subnet-d09eb8ec",
        ]
      + tags                                                         = {
          + "costCenter"  = "Pocket"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "SharesAPI"
        }
      + tags_all                                                     = {
          + "costCenter"  = "Pocket"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "SharesAPI"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = "pocket-data-items"
          + enabled = true
          + prefix  = "server-logs/sharesapi-prod/alb"
        }
    }

  # aws_alb_listener.application_listener_http_D74EC0ED will be created
  + resource "aws_alb_listener" "application_listener_http_D74EC0ED" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "costCenter"  = "Pocket"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "SharesAPI"
        }
      + tags_all          = {
          + "costCenter"  = "Pocket"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "SharesAPI"
        }

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_alb_listener.application_listener_https_D31CB055 will be created
  + resource "aws_alb_listener" "application_listener_https_D31CB055" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-TLS-1-1-2017-01"
      + tags              = {
          + "costCenter"  = "Pocket"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "SharesAPI"
        }
      + tags_all          = {
          + "costCenter"  = "Pocket"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "SharesAPI"
        }

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + status_code  = "503"
            }
        }
    }

  # aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F will be created
  + resource "aws_alb_listener_rule" "application_ecs_service_listener_rule_903F815F" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 1
      + tags         = {
          + "costCenter"  = "Pocket"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "SharesAPI"
        }
      + tags_all     = {
          + "costCenter"  = "Pocket"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "SharesAPI"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B will be created
  + resource "aws_alb_target_group" "application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "120"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "SHARES"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "costCenter"  = "Pocket"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "SharesAPI"
          + "type"        = "blue"
        }
      + tags_all                           = {
          + "costCenter"  = "Pocket"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "SharesAPI"
          + "type"        = "blue"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-867638e3"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 15
          + matcher             = (known after apply)
          + path                = "/.well-known/apollo/server-health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }
    }

  # aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6 will be created
  + resource "aws_alb_target_group" "application_ecs_service_green_target_group_ecs_target_group_4E06DCA6" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "120"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "SHARES"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "costCenter"  = "Pocket"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "SharesAPI"
          + "type"        = "green"
        }
      + tags_all                           = {
          + "costCenter"  = "Pocket"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "SharesAPI"
          + "type"        = "green"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-867638e3"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 15
          + matcher             = (known after apply)
          + path                = "/.well-known/apollo/server-health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }
    }

  # aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511 will be created
  + resource "aws_appautoscaling_policy" "application_autoscaling_scale_in_policy_BF273511" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "SharesAPI-Prod-ScaleInPolicy"
      + policy_type        = "StepScaling"
      + resource_id        = "service/SharesAPI-Prod/SharesAPI-Prod"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_upper_bound = "0"
              + scaling_adjustment          = -1
            }
        }
    }

  # aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2 will be created
  + resource "aws_appautoscaling_policy" "application_autoscaling_scale_out_policy_D03900A2" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "SharesAPI-Prod-ScaleOutPolicy"
      + policy_type        = "StepScaling"
      + resource_id        = "service/SharesAPI-Prod/SharesAPI-Prod"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = 2
            }
        }
    }

  # aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99 will be created
  + resource "aws_appautoscaling_target" "application_autoscaling_autoscaling_target_42BF5C99" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 2
      + resource_id        = "service/SharesAPI-Prod/SharesAPI-Prod"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = {
          + "costCenter"  = "Pocket"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "SharesAPI"
        }
    }

  # aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED will be created
  + resource "aws_cloudwatch_dashboard" "application_cloudwatch-dashboard_1F3DC0ED" {
      + dashboard_arn  = (known

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

     + zone_id             = (known after apply)
    }

  # aws_s3_bucket.synthetics_synthetics_synthetic_check_artifacts_53DD59E6 will be created
  + resource "aws_s3_bucket" "synthetics_synthetics_synthetic_check_artifacts_53DD59E6" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "pocket-sharesapi-prod-synthetic-checks"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "costCenter"  = "Pocket"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "SharesAPI"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.synthetics_synthetics_synthetic_check_artifacts_lifecycle_5A7B9150 will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "synthetics_synthetics_synthetic_check_artifacts_lifecycle_5A7B9150" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + id     = "30-day-retention"
          + status = "Enabled"

          + expiration {
              + days                         = 30
              + expired_object_delete_marker = (known after apply)
            }
        }
    }

  # aws_security_group.application_application_load_balancer_alb_security_group_7B45D070 will be created
  + resource "aws_security_group" "application_application_load_balancer_alb_security_group_7B45D070" {
      + arn                    = (known after apply)
      + description            = "External security group  (Managed by Terraform)"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "required"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "SharesAPI-Prod-HTTP/S Security Group"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"        = "SharesAPI-Prod-HTTP/S Security Group"
          + "costCenter"  = "Pocket"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "SharesAPI"
        }
      + tags_all               = {
          + "Name"        = "SharesAPI-Prod-HTTP/S Security Group"
          + "costCenter"  = "Pocket"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "SharesAPI"
        }
      + vpc_id                 = "vpc-867638e3"
    }

  # aws_security_group.application_ecs_service_ecs_security_group_231C6B1E will be created
  + resource "aws_security_group" "application_ecs_service_ecs_security_group_231C6B1E" {
      + arn                    = (known after apply)
      + description            = "Internal ECS Security Group (Managed by Terraform)"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "required"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "required"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 4031
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "SharesAPI-Prod-ECSSecurityGroup"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "costCenter"  = "Pocket"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "SharesAPI"
        }
      + tags_all               = {
          + "costCenter"  = "Pocket"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "SharesAPI"
        }
      + vpc_id                 = "vpc-867638e3"
    }

  # aws_sns_topic.pagerduty_alarm-critical-topic_F1534579 will be created
  + resource "aws_sns_topic" "pagerduty_alarm-critical-topic_F1534579" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "SharesAPI-Prod-Infrastructure-Alarm-Critical"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "costCenter"  = "Pocket"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "SharesAPI"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3 will be created
  + resource "aws_sns_topic" "pagerduty_alarm-non-critical-topic_53C1A3B3" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "SharesAPI-Prod-Infrastructure-Alarm-Non-Critical"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "costCenter"  = "Pocket"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "SharesAPI"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84 will be created
  + resource "aws_sns_topic_subscription" "pagerduty_alarm-critical-subscription_E2168B84" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 2
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = true
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B will be created
  + resource "aws_sns_topic_subscription" "pagerduty_alarm-non-critical-subscription_4702677B" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 2
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = true
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_synthetics_canary.synthetics_synthetics_synthetic_check_query_0_99E4AE1B will be created
  + resource "aws_synthetics_canary" "synthetics_synthetics_synthetic_check_query_0_99E4AE1B" {
      + arn                      = (known after apply)
      + artifact_s3_location     = "s3://pocket-sharesapi-prod-synthetic-checks/"
      + delete_lambda            = false
      + engine_arn               = (known after apply)
      + execution_role_arn       = (known after apply)
      + failure_retention_period = 31
      + handler                  = "synthetic.query"
      + id                       = (known after apply)
      + name                     = "shares-prod-query-0"
      + runtime_version          = "syn-nodejs-puppeteer-6.2"
      + s3_bucket                = "pocket-syntheticchecks-prod"
      + s3_key                   = "aws-synthetic-prod.zip"
      + source_location_arn      = (known after apply)
      + start_canary             = true
      + status                   = (known after apply)
      + success_retention_period = 31
      + tags_all                 = {
          + "costCenter"  = "Pocket"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "SharesAPI"
        }
      + timeline                 = (known after apply)

      + run_config {
          + environment_variables = {
              + "GRAPHQL_ENDPOINT" = "shares-api.readitlater.com"
              + "GRAPHQL_JMESPATH" = "data.__typename"
              + "GRAPHQL_QUERY"    = "query { __typename }"
              + "GRAPHQL_RESPONSE" = "Query"
            }
          + memory_in_mb          = (known after apply)
          + timeout_in_seconds    = 180
        }

      + schedule {
          + expression = "rate(5 minutes)"
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-2efb704a",
            ]
          + subnet_ids         = [
              + "subnet-610bdb3b",
              + "subnet-b2a036fa",
              + "subnet-cc66bde0",
              + "subnet-d09eb8ec",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB will be created
  + resource "aws_synthetics_canary" "synthetics_synthetics_synthetic_check_uptime_0_4168D0DB" {
      + arn                      = (known after apply)
      + artifact_s3_location     = "s3://pocket-sharesapi-prod-synthetic-checks/"
      + delete_lambda            = false
      + engine_arn               = (known after apply)
      + execution_role_arn       = (known after apply)
      + failure_retention_period = 31
      + handler                  = "synthetic.uptime"
      + id                       = (known after apply)
      + name                     = "shares-prod-uptime-0"
      + runtime_version          = "syn-nodejs-puppeteer-6.2"
      + s3_bucket                = "pocket-syntheticchecks-prod"
      + s3_key                   = "aws-synthetic-prod.zip"
      + source_location_arn      = (known after apply)
      + start_canary             = true
      + status                   = (known after apply)
      + success_retention_period = 31
      + tags_all                 = {
          + "costCenter"  = "Pocket"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "SharesAPI"
        }
      + timeline                 = (known after apply)

      + run_config {
          + environment_variables = {
              + "UPTIME_BODY" = "ok"
              + "UPTIME_URL"  = "shares-api.readitlater.com/.well-known/apollo/server-health"
            }
          + memory_in_mb          = (known after apply)
          + timeout_in_seconds    = 180
        }

      + schedule {
          + expression = "rate(5 minutes)"
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-2efb704a",
            ]
          + subnet_ids         = [
              + "subnet-610bdb3b",
              + "subnet-b2a036fa",
              + "subnet-cc66bde0",
              + "subnet-d09eb8ec",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # pagerduty_service.pagerduty_pagerduty-critical_464EE7CD will be created
  + resource "pagerduty_service" "pagerduty_pagerduty-critical_464EE7CD" {
      + acknowledgement_timeout = "1800"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "14400"
      + created_at              = (known after apply)
      + description             = "PagerDuty Critical"
      + escalation_policy       = "PXOQVEP"
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "SharesAPI-Prod-PagerDuty-Critical"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + incident_urgency_rule {
          + type    = "constant"
          + urgency = "high"
        }
    }

  # pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938 will be created
  + resource "pagerduty_service" "pagerduty_pagerduty-non-critical_B4CB3938" {
      + acknowledgement_timeout = "1800"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "14400"
      + created_at              = (known after apply)
      + description             = "PagerDuty Non-Critical"
      + escalation_policy       = "PXOQVEP"
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "SharesAPI-Prod-PagerDuty-Non-Critical"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + incident_urgency_rule {
          + type    = "constant"
          + urgency = "low"
        }
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

Plan: 60 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ecs-codedeploy-app     = "SharesAPI-Prod-ECS"
  + ecs-codedeploy-group   = "SharesAPI-Prod-ECS"
  + ecs-task-arn           = (known after apply)
  + ecs-task-containerName = "app"
  + ecs-task-containerPort = 4031
  + ecs-task-family        = "SharesAPI-Prod"
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"71a25610-ecd0-4107-9ab4-3bcadc51e106","JobName":"shares-api_infrastructure_plan_prod","PRNumber":463,"Program":"tfcmt","SHA1":"9127f18388ceed8ab2db747e370b4d00bb87a336","Target":"shares-api-cdk","Vars":{}} -->